vehicular/PowerBoard_SW/msp430f6736/DesignCenter/guiApp/hmiDC/hmi.c
COMAND_HANDLER *DC_User_Params;

/*** GLOBAL VARIABLES ***/
Packet_t gstxPacket = {0};

void HMI_Init(void)
{
    // Initializes command handler for communication with GUI
    CommandHandler_setApplicationVersion(
            COMMAND_HANDLER_DEVICE_TYPE_F6736,
            COMMAND_HANDLER_FIRMWARE_ID_0001);

    // Initialize communications
    Comm_setup();
    CommandHandler_registerCmdListeners();
	DC_User_Params = CommandHandler_getUserParamsPtr();
	gHMI = HMI_STATE_IDLE;
#ifdef ENABLE_LCD
    results_Reset(LPH);
#endif
}

void HMI_sendPhaseResults(uint8_t phaseIdx, uint8_t phaseID)
{
    // Transmit VRMS
    CommandHandler_transmitVRMS(&gstxPacket,
                                phaseID,
                                (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].VRMS);

    // Transmit IRMS
    CommandHandler_transmitIRMS(&gstxPacket,
                                phaseID,
                                (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].IRMS);

    // Transmit V Peak
    CommandHandler_transmitVPeak(&gstxPacket,
                                phaseID,
                                (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].vPeak);

    // Transmit I Peak
    CommandHandler_transmitIPeak(&gstxPacket,
                                phaseID,
                                (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].iPeak);

    // Transmit Power Factor
    CommandHandler_transmitPowerFactor(&gstxPacket,
                                       phaseID,
                                       (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].powerFactor);

    // Transmit Frequency
    CommandHandler_transmitFrequency(&gstxPacket,
                                     phaseID,
                                     (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].frequency);

    // Transmit Active Power
    CommandHandler_transmitActivePower(&gstxPacket,
                                       phaseID,
                                       (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].activePower);

    // Transmit Reactive Power
    CommandHandler_transmitReactivePower(&gstxPacket,
                                         phaseID,
                                         (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].reactivePower);

    // Transmit Apparent Power
    CommandHandler_transmitApparentPower(&gstxPacket,
                                         phaseID,
                                         (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].apparentPower);

    // Transmit Active Energy
    CommandHandler_transmitActiveEnergy(&gstxPacket,
                                        phaseID,
                                        (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].activeEnergy);

    // Transmit Reactive Energy
    CommandHandler_transmitReactiveEnergy(&gstxPacket,
                                         phaseID,
                                         (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].reactiveEnergy);

    // Transmit Apparent Energy
    CommandHandler_transmitApparentEnergy(&gstxPacket,
                                          phaseID,
                                          (uint8_t *) &gEmSWResult.phaseResults[phaseIdx].apparentEnergy);

}

void HMI_sendTotalPhaseResults()
{
    // Transmit Active Power
    CommandHandler_transmitActivePower(&gstxPacket,
                                       HAL_ADC_PHASE_TOTAL_DATA_READY,
                                       (uint8_t *) &gEmSWResult.emTotalResult->activePower);

    // Transmit Reactive Power
    CommandHandler_transmitReactivePower(&gstxPacket,
                                         HAL_ADC_PHASE_TOTAL_DATA_READY,
                                         (uint8_t *) &gEmSWResult.emTotalResult->reactivePower);

    // Transmit Apparent Power
    CommandHandler_transmitApparentPower(&gstxPacket,
                                         HAL_ADC_PHASE_TOTAL_DATA_READY,
                                         (uint8_t *) &gEmSWResult.emTotalResult->apparentPower);

    // Transmit Active Energy
    CommandHandler_transmitActiveEnergy(&gstxPacket,
                                        HAL_ADC_PHASE_TOTAL_DATA_READY,
                                        (uint8_t *) &gEmSWResult.emTotalResult->activeEnergy);

    // Transmit Reactive Energy
    CommandHandler_transmitReactiveEnergy(&gstxPacket,
                                         HAL_ADC_PHASE_TOTAL_DATA_READY,
                                         (uint8_t *) &gEmSWResult.emTotalResult->reactiveEnergy);

    // Transmit Apparent Energy
    CommandHandler_transmitApparentEnergy(&gstxPacket,
                                          HAL_ADC_PHASE_TOTAL_DATA_READY,
                                          (uint8_t *) &gEmSWResult.emTotalResult->apparentEnergy);

}

void HMI_processPhaseResults(uint8_t resultStatus)
{
    // Check if Phase A is ready
    if(resultStatus & HAL_ADC_PHASE_A_DATA_READY)
    {
        HMI_sendPhaseResults(EM_PH_A_IDX,
                             HAL_ADC_PHASE_A_DATA_READY);
     }

}

void HMI_sendCalibValues()
{
    // Send Calibration Values for Phase A
    CommandHandler_transmitCalibration(&gstxPacket,
                                       HAL_ADC_PHASE_A_DATA_READY,
                                       (uint8_t *) gEmSWConfig.meterConfig->phaseConfigPtr[EM_PH_A_IDX].phaseCalibPtr);

    // Send a command with done bit
    CommandHandler_transmitReqCalibrationValues(&gstxPacket);

}

void HMI_updatePhaseIDx()
{
    switch(gCommandHandler.calibPhaseID)
    {
        case HAL_ADC_PHASE_A_DATA_READY:
            gCommandHandler.calibPhaseIdx = EM_PH_A_IDX;
            break;
        default:
            gCommandHandler.calibPhaseIdx = 0;
            break;
    }
}

void HMI_stateMachine(uint8_t resultStatus)
{
    // Process incoming commands
    Comm_listenForCmd();                            /*Listen for any incoming commands      */

    gHMI = (HMI_STATE_t) gCommandHandler.appMode;

