vehicular/PowerBoard_SW/msp430f6736/DesignCenter/guiApp/hmiDC/hmi.c
    if(COMMAND_HANDLER_CALIB_REQ_IN_PROGRESS == gCommandHandler.calibReqUpdate)
    {
        HMI_sendCalibValues();
        // Clear calibration req update flag
        gCommandHandler.calibReqUpdate = COMMAND_HANDLER_CALIB_REQ_IDLE;
    }

    switch(gHMI)
    {
        case HMI_STATE_IDLE:
            // No results sent to EMDC
            break;
        case HMI_STATE_ACTIVE:
            HMI_processPhaseResults(resultStatus);
            break;
        case HMI_STATE_CALIBRATE:

            // Check if phase idx needs to be updated
            if(gCommandHandler.calibPhaseIdxFlag)
            {
                // Clear phase idx flag
                gCommandHandler.calibPhaseIdxFlag = false;
                HMI_updatePhaseIDx();
            }

            // Check if the preload values need to be updated
            if(gCommandHandler.calibSetPreloadFlag)
            {
                // Clear phase preload flag
                gCommandHandler.calibSetPreloadFlag = false;

                // Update preload values & re initialize the conversions
                __disable_interrupt();
                  HAL_ADC_stopConversion(&halAdcConfig);
                  HAL_ADC_init(&halAdcConfig);
                  HAL_ADC_startConversion(&halAdcConfig);
                  __enable_interrupt();

            }

            // Check if the calibration values must be written memory
            if(gCommandHandler.calibReqSaveFlag)
            {
                // Clear calib req save flag
                gCommandHandler.calibReqSaveFlag = false;

                // Write calibration to flash memory
                EM_updateFlashCalibrationValues((uint8_t *)g_emPhaseCalibration,
                                                (uint8_t *)g_savedEmPhaseCalibration);

                // Send Flash Write complete to host
                CommandHandler_transmitCalibrationSave(&gstxPacket);
            }

            if(gCommandHandler.calibPhaseID > 0 && (gCommandHandler.calibPhaseID & resultStatus))
            {
                HMI_sendPhaseResults(gCommandHandler.calibPhaseIdx, gCommandHandler.calibPhaseID);
            }

            break;
    }
}
